{
  "basics": {
    "name": "Glenn Galvizo", 
    "label": "Graduate Student",
    "picture": "https://glennga.github.io/images/profile-image.jpg",
    "email": "gjgalvizo@gmail.com",
    "phone": "808-260-3894",
    "website": "https://glennga.github.io",
    "summary": "Hello all! I am currently a Computer Science Ph.D. student at the University of California, Irvine working in the Information Systems Group on the AsterixDB project.",
    "profiles": [
      {
        "network": "github",
        "username": "glennga",
        "url": "http://github.com/glennga"
      }
    ]
  },
  "education": [
    {
      "institution": "University of California, Irvine, CA",
      "area": "Computer Science",
      "studyType": "Doctorate of Philosophy",
      "startDate": "2019-09-28"
      ]
    },
    {
      "institution": "University of California, Irvine, CA",
      "area": "Computer Science",
      "studyType": "Masters of Science",
      "startDate": "2019-09-28",
      "endDate": "2021-05-28"
    },
    {
      "institution": "University of Hawaii at Manoa, Honolulu, HI",
      "area": "Computer Science, Mathematical Biology",
      "studyType": "Bachelor of Science, Certificate",
      "startDate": "2016-09-01",
      "endDate": "2018-12-01",
      "gpa": "3.96"
    },
        {
      "institution": "Leeward Community College, Pearl City, HI",
      "area": "Liberal Arts",
      "studyType": "Associate of Arts",
      "startDate": "2014-08-25",
      "endDate": "2015-12-19",
      "gpa": "4.0"
    }
  ],
  "awards": [
      {
        "title": "Hasso Plattner Institute Research in Machine Learning and Data Science Fellowship at UC Irvine",
        "date": "2021-01-01",
        "awarder": "Hasso Plattner Institute Research in Machine Learning and Data Science",
        "summary": "Fellowship funding for research to support adaptive, safe, and human centered artificial intelligence."
      },
      {
        "title": "Very Large Data Base Scholarship",
        "date": "2018-06-01",
        "awarder": "Very Large Data Base Endowment Incorperated",
        "summary": "$2000 merit based scholarship to study data management related topics." 
      },
      {
        "title": "Undergraduate Research Opportunity Program Grant",
        "date": "2017-12-01",
        "awarder": "Undergraduate Research Opportunities Program",
        "summary": "$4890 to fund the project 'Analysis and Optimization of Lost-in-Space Star Identification'."
      },
      {
	"title": "Hawaii Space Flight Laboratory Traineeship",
	"date": "2015-03-01",
	"awarder": "Hawaii Space Grant Consortium", 
	"summary": "$3000 to help develop sensor logging and flight path estimation software for CATSAT-1, a stationary payload on a sounding rocket."
      }
  ],
  "papers": [
    {
        "text": "Galvizo G. 2021. <b>On Indexing Multi-Valued Fields in AsterixDB.</b> Master's thesis. University of California, Irvine."
    },
    {
        "text": "Galvizo G. and Lim L. 2019. <b>An Experimental Survey of Evaluation Strategies for Constellation Queries.</b> In Proceedings of the 31st International Conference on Scientific and Statistical Database Management (SSDBM '19). ACM, New York, NY, USA, 210-213. DOI: https://doi.org/10.1145/3335783.333580"
    },
    {
        "text": "Galvizo G. <b>Efficient Parameter Estimation for Human Microsatellite Mutation</b>. Accepted writing for the Mathematical Biology Certificate Committee at the University of Hawaii at Manoa, Nov. 30, 2018."
    },
    {
        "text": "Galvizo G. <b>Efficient Parameter Estimation for Human Microsatellite Mutation</b>. Presented at the University of Hawaii at Manoa Undergraduate Showcase, Honolulu, HI, United States, Dec. 7, 2018; oral presentation."
    },
    {
        "text": "Galvizo G. <b>Analysis and Optimization of Lost-in-Space Star Identification</b>. Presented at the University of Hawaii at Manoa Undergraduate Showcase, Honolulu, HI, United States, Dec. 8, 2017; oral presentation."
    },
    {
        "text": "Galvizo G., Izumigawa C., Lam J., Li T., Nguyen A., Saymo A., Xu P., Yasunaga C. <b>Hawaii Space Flight Laboratory: Sounding Rocket Trainees</b>. Presented at the Hawaii Space Grant Fellowship and Traineeship Symposium, Honolulu, HI, United States, Apr. 23, 2016; oral presentation."
    },
    {
        "text": "Galvizo G., Izumigawa C., Li T., Nguyen A., Saymo A., Yasunaga C. <b>Hawaii Space Flight Laboratory: Sounding Rocket Trainees</b>. Presented at the Hawaii Space Grant Fellowship and Traineeship Symposium, Honolulu, HI, United States, Nov. 21, 2015; oral presentation."
    }
  ],
  "work": [
     {
      "company": "Couchbase",
      "position": "Software Engineering R&D Intern",
      "startDate": "2021-06-21",
      "summary": "Fine polishing multi-valued indexes in AsterixDB for use in Couchbase Analytics."
     },
     {
      "company": "University of California, Irvine",
      "position": "Teaching Assistant",
      "startDate": "2019-09-01",
      "endDate": "2020-12-01",
      "summary": "Created assignments in a beyond SQL class for Postgres, Cassandra, Couchbase, and Neo4J (Winter 2020). Led discussions and created assignments in an introductory database course (Spring 2020, Fall 2020).",
      "highlights": [
          "Created datasets and scenarios to extract meaningful information from said datasets.",
          "Datasets include the Yelp dataset, a homegrown inventory management service, and a homegrown Twitter tagging service."
      ]
     },
     {
      "company": "Hawaii Space Flight Laboratory",
      "position": "Software Engineer (previously High Level Software Intern)",
      "website": "http://www.hsfl.hawaii.edu/",
      "startDate": "2015-03-01",
      "endDate": "2019-08-01",
      "summary": "Contributed software to NMSR, the HSFL star tracker, COSMOS, and most recently the Neutron-1 projects.",
      "highlights": [
        "Developed cross-platform memory/load/disk library for COSMOS project.",
    	"Created COSMOS agents and libraries for star based attitude estimation, and IMU based attitude estimation.",
        "Optimized and tested motion-tracking and orientation simulating processes for the satellite testbed.",
        "Implemented time-synchronization protocol across agents in the COSMOS framework."
      ]
     },
     {
      "company": "Mary, Star of the Sea School",
      "position": "Information Technology Specialist",
      "website": "https://www.marystarelementary.com",
      "startDate": "2019-02-01",
      "endDate": "2019-08-01",
      "summary": "Manage and service network, computers, smartboards, and other technology for the entire school.",
      "highlights": [
        "Setup remote management of the network, firewall, and access points.",
        "Organized a better integrated ticketing system at a lower cost to their previous setup.",
        "Mapped school network and optimized cable flow to and from various endpoints."
      ]
     },
     {
      "company": "Maryknoll School",
      "position": "VEX Robotics Head Coach",
      "startDate": "2016-08-21",
      "endDate": "2019-01-12",
      "summary": "Mentor 4th-12th grade students in the development, design, and application of robotics through VEX.",
      "highlights": [
        "Guide, mentor, and coach elementary to high school students in creating VEX and FRC competition robots.",
        "Created and ran several lectures on the basics of RobotC programming for VEX.",
    	"Students are taught the basics of mechanical design, documentation, C-based programming, game strategy, project management, and teamwork."
      ]
    },
    {
      "company": "University of Hawaii Information and Computer Sciences",
      "position": "Assistant Computer Technician",
      "website": "http://www.ics.hawaii.edu/",
      "startDate": "2016-09-07",
      "endDate": "2017-08-01",
      "summary": "Manage lab machines for ICS department.",
      "highlights": [
        "Serviced four labs of computers, users and the networks connecting them.",
	"Assisted students and professors with all machine related issues",
	"Automated the development and unattended installation and updates of Windows programs across all lab computers.",
    	"Developed Powershell scripts to automate Active Directory user account renewal and additions."
      ]
    }
  ],
  "volunteer": [
    {
      "organization": "Hawaii FIRST Tech Challenge",
      "website": "http://www.firstinspires.org/robotics/ftc",
      "position": "Referee",
      "startDate": "2014-10-01",
      "endDate": "2018-12-01",
      "summary": "Ensure robotics game is played in fair and consistent manner."
    },
    {
      "organization": "Arnold Air Society",
      "website": "https://manoa.hawaii.edu/undergrad/aerospace/join-our-clubs/",
      "position": "Support Officer / Information Management Officer",
      "startDate": "2014-09-01",
      "endDate": "2015-12-01",
      "summary": "Managed minutes and information regarding our meetings and community service events.",
      "highlights": [
      ]
    }
  ],
  "interests": [
    {
      "name": "graph databases",
      "keywords": [
        "graph data model",
        "large graphs",
        "neo4j"
      ]
    },
    {
      "name": "query processing",
      "keywords": [
        "query optimization",
        "query planning"
      ]
    },
    {
      "name": "big data engineering",
      "keywords": [
        "distributed systems",
        "semi-structured data management"
      ]
    }
  ],
  "references": [
    {
      "name": "Available upon request",
      "reference": ""
    }
  ]
}
